Revit 2018 API
PanelScheduleData Properties
The PanelScheduleData type exposes the following members.
Properties
Name | Description
BodyShowsVerticalHeaders
 Shows text in the Load Summary section's headers vertically instead of horizontally
BorderAroundSchedule
 Places a border (GraphicStyle element) around the entire schedule, visible only on the instance and sheet
BorderAroundSections
 Places a border (GraphicStyle element) around each section, visible only on the instance and sheet
FreezeColumnsAndRows
 set to true if the columns and rows should be unmovable by the slider grips
 (Inherited from TableData.)
IsFooterSectionHidden
 True if the user wishes to hide the footer section; setting this value must go through the appropriate update function
IsHeaderSectionHidden
 True if the user wishes to hide the header section; setting this value must go through the appropriate update function
IsPanelSinglePhase
 Identifies if the panel is single phase.
IsSummarySectionHidden
 True if the user wishes to hide the summary section; setting this value must go through the appropriate update function
IsThirdPhaseHidden
 True if the user wishes to hide the 3rd phase column of a single phase panel
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from TableData.)
NumberOfSections
 Gets the number of items in section data array.
 (Inherited from TableData.)
NumberOfSlots
 The number of slots in the panel schedule; setting this value must go through the appropriate update function
PanelConfiguration
 The panel configuration of this panel schedule
PhaseLoadType
 This property determines the layout of the phase load columns; setting this value must go through the updateCircuitTable function
PhasesAsCurrents
 If true, the phase columns are currents (A), otherwise they are loads (VA); setting this value must go through the appropriate update function
ScheduleType
 The panel schedule type of this panel schedule
ShowCircuitNumberOnOneRowForMultiphaseCircuits
 Shows the circuit number broken up on each row of the multiphase circuit rows if true, all on the first row otherwise
ShowMultipleRowsForMultiphaseCircuits
 shows extra rows below multiphase circuits to indicate how many slots they take up if true, all on a single row otherwise
ShowSlotFromDeviceInsteadOfTemplate
 When true, the number of rows in an instance will be the number of poles on the associated device, not a set number
SummaryShowsGroups
 Show groups of load classifications in the load summary section
SummaryShowsOnlyConnectedLoads
 Show only the connected load classifications in the summary section
SummaryShowsVerticalHeaders
 Shows text in the Load Summary section's headers vertically instead of horizontally
Width
 Gets or sets the table width in feet
 (Inherited from TableData.)
WidthInPixels
 Gets the width of the panel schedule in pixels
 (Inherited from TableData.)
See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace